---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainType
source: html/2eb05eea-d952-7a2e-5858-57c3ba51e8ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainType Property

"Main Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainType { get; }
```